# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Binaries
brew "bash"
brew "bash-completion2"
brew "findutils"
brew "gnu-sed"
brew "gnupg"
brew "moreutils"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Tools
brew "ack"
brew "curl"
brew "gawk"
brew "grep"
brew "htop"
brew "openssh"
brew "tree"
brew "wget"

# Utilities
brew "aria2"
brew "bat"
brew "diff-so-fancy"
brew "exa"
brew "fd"
brew "fzf"
brew "jq"
brew "nnn"
brew "pigz"
brew "prettyping"
brew "ranger"
brew "ripgrep"
brew "starship"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "z"

# Development
brew "dive"
brew "git"
brew "git-lfs"
brew "go"
brew "kind"
brew "kubectl"
brew "kubectx"
brew "neovim"
brew "python"
brew "terraform"
brew "tmux"

# Apps
cask "alacritty"
cask "alfred"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "keka"
cask "rectangle"
cask "vlc"

# Fonts
cask "font-hack-nerd-font"
